wiki/nginx-wiki.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-18 一 16:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nginx wiki</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pengpengxp" />
<link rel="stylesheet" type="text/css" href="http://pengpengxp.github.io/css/wiki.css" />
</head>
<body>
<div id="content">
<h1 class="title">Nginx wiki</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6c218fa">1. nginx打印ngx<sub>str</sub><sub>t到日志</sub></a></li>
<li><a href="#orge5e855a">2. 4层和7层load-balance</a></li>
<li><a href="#org76c6bfb">3. nginx四层lb的配置</a></li>
<li><a href="#org6053f5f">4. nginx编译的顺序和模块选择</a></li>
</ul>
</div>
</div>


<div id="outline-container-org6c218fa" class="outline-2">
<h2 id="org6c218fa"><span class="section-number-2">1</span> nginx打印ngx<sub>str</sub><sub>t到日志</sub></h2>
<div class="outline-text-2" id="text-1">
<p>
因为ngx<sub>str</sub><sub>t默认不是以</sub> <code>\0</code> 结尾的。所以不能直接使用printf来打印。
不过nginx打印日志接口默认提供了一种 <code>%V</code> 的方式。
</p>
<div class="org-src-container">
<pre class="src src-C">    <span style="color: #9acd32;">ngx_log_debug1</span>(NGX_LOG_DEBUG_HTTP, r-&gt;connection-&gt;log, 0, <span style="color: #ffa500;">"[Test]: big v %V"</span>, &amp;(r-&gt;method_name));
    <span style="color: #9acd32;">ngx_log_debug1</span>(NGX_LOG_DEBUG_HTTP, r-&gt;connection-&gt;log, 0, <span style="color: #ffa500;">"[Test]: big v uri = %V"</span>, &amp;(r-&gt;uri));
</pre>
</div>

<p>
<b>注意这里需要的是ngx<sub>str</sub><sub>t的地址</sub>。</b>
</p>
</div>
</div>

<div id="outline-container-orge5e855a" class="outline-2">
<h2 id="orge5e855a"><span class="section-number-2">2</span> 4层和7层load-balance</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://www.nginx.com/resources/glossary/layer-4-load-balancing/">https://www.nginx.com/resources/glossary/layer-4-load-balancing/</a>
</p>

<p>
<a href="https://www.nginx.com/resources/glossary/layer-7-load-balancing/">https://www.nginx.com/resources/glossary/layer-7-load-balancing/</a>
</p>

<p>
有4层和7层之分。
</p>

<p>
4层以前用得多，因为7层对计算性能要求较高。
</p>

<p>
4层就是直接看ip和port，在第四层就开始均衡。不看content的。
</p>

<p>
7层会看到content，可以根据数据来玩。
</p>
<pre class="example">
    They manage and manipulate traffic based on a full understanding of
    the transaction between the client and the application server.
</pre>

<p>
7层的好处，举个例子：
</p>
<pre class="example">
    Let’s look at a simple example. A user visits a high-traffic
    website. Over the course of the user’s session, he or she might
    request static content such as images or video, dynamic content such
    as a news feed, and even transactional information such as order
    status. Layer 7 load balancing allows the load balancer to route a
    request based on information in the request itself, such as what kind
    of content is being requested. So now a request for an image or video
    can be routed to the servers that store it and are highly optimized to
    serve up multimedia content. Requests for transactional information
    such as a discounted price can be routed to the application server
    responsible for managing pricing. With Layer 7 load balancing, network
    and application architects can create a highly tuned and optimized
    server infrastructure or application delivery network that is both
    reliable and efficiently scales to meet demand.
</pre>
<p>
比如图片个视频的请求可以负载到一个对此优化过的机器上。关于price的请
求可能负载到一个专门处理price的机器上。
</p>
</div>
</div>

<div id="outline-container-org76c6bfb" class="outline-2">
<h2 id="org76c6bfb"><span class="section-number-2">3</span> nginx四层lb的配置</h2>
<div class="outline-text-2" id="text-3">
<p>
自己手动编译的 <code>1.11.3</code> 版本。编译时需要加入 <code>--with-stream</code> 选项。
</p>
<div class="org-src-container">
<pre class="src src-sh">    ./configure --with-stream
</pre>
</div>

<p>
配置如下，把本地的80代理到后端的多个80：
</p>
<pre class="example">

</pre>
<div class="org-src-container">
<pre class="src src-conf-space">    <span style="color: #8fbc8f;">user</span>  root;
    <span style="color: #8fbc8f;">worker_processes</span>  40;

    <span style="color: #00ff00;">events</span> {
        <span style="color: #8fbc8f;">worker_connections</span>  1024;
    <span style="color: #8fbc8f;">}</span>

    <span style="color: #00ff00;">stream</span> {
            <span style="color: #00ff00;">upstream backend</span> {
                <span style="color: #cd5c5c;">#</span><span style="color: #cd5c5c;">least_conn;</span>
                <span style="color: #cd5c5c;">#</span><span style="color: #cd5c5c;">hash $remote_addr;</span>
                <span style="color: #8fbc8f;">server</span> 172.16.2.172:80;
                <span style="color: #8fbc8f;">server</span> 172.16.2.171:80;
                <span style="color: #8fbc8f;">server</span> 172.16.2.7:80;

            <span style="color: #8fbc8f;">}</span>

            <span style="color: #00ff00;">server</span> {
                <span style="color: #8fbc8f;">listen</span>        0.0.0.0:80;
                <span style="color: #8fbc8f;">proxy_pass</span>    backend;

                <span style="color: #cd5c5c;">#</span><span style="color: #cd5c5c;">proxy_bind $remote_addr  transparent;</span>
                <span style="color: #cd5c5c;">#</span><span style="color: #cd5c5c;">proxy_timeout 3s;</span>
                <span style="color: #cd5c5c;">#</span><span style="color: #cd5c5c;">proxy_connect_timeout 1s;</span>
                <span style="color: #cd5c5c;">#</span><span style="color: #cd5c5c;">proxy_set_header X-Forwarded-For $remote_addr;</span>
            <span style="color: #8fbc8f;">}</span>
        <span style="color: #8fbc8f;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org6053f5f" class="outline-2">
<h2 id="org6053f5f"><span class="section-number-2">4</span> nginx编译的顺序和模块选择</h2>
<div class="outline-text-2" id="text-4">
<p>
configure中进来。有些模块需要根据来决定是否启用（如
ngx<sub>http</sub><sub>gunzip</sub><sub>filter</sub><sub>module模块</sub>）。
</p>

<p>
configure会调用到 <code>auto/modules</code> ，这个里面是实际加载哪些模块和模块
调用顺序的。它主要生成了 <code>ngx_modules.c</code> 文件。该文件中定义了
<code>ngx_modules</code> 数组。它指明nginx运行时有哪些模块需要参与，以及它们之
间的顺序是什么。
</p>

<p>
我们的代码中，是从 <code>txsafe-configure.sh</code> 中进入到configure的。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pengpengxp</p>
<p class="date">Created: 2019-03-18 一 16:46</p>
<p class="validation"></p>
</div>
</body>
</html>
